Catalogs/питМеню.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>питМеню</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Рецептура</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.питРецептура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерВГруппе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Выключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИмяКартинки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЦветФонаКнопок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MRS_КодSimphony</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MRS_СтатусСинхронизацииSimphony</Name>
					<Type>
						<v8:Type>cfg:EnumRef.MRS_СтатусыСинхронизацииSimphony</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/MRS_ИсторияСинхронизацииМенюSimphony.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>MRS_ИсторияСинхронизацииМенюSimphony</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>HTTPСтатус</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлительностьМс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПозицияМеню</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.питМеню</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/питМеню/Forms/МФормаЭлемента/Ext/Form/Module.bsl
// Модуль формы элемента справочника.
Перем СпособРасчетаРецептур;  			// Способ подбора основной рецептуры для блюда.
Перем ЦветФонаПоУмолчанию;    // Цвет фона кнопки, если он явно не задан.
Перем ПредыдущаяНоменклатура; // Предыдущее значение номенклатуры для отслеживания изменений.

&НаКлиенте
Перем КаталогКартинок;        // Каталог картинок для "гибких" кнопок.

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Обновляет надписи на форме
//
Процедура ОбновитьНадписи()
	
	Если ПустаяСтрока(Объект.ИмяКартинки) Тогда
		Элементы.тКартинка.Заголовок = "Выбор картинки";
	Иначе
		Элементы.тКартинка.Заголовок = Объект.ИмяКартинки;
		Элементы.тОчистить.Заголовок = "Очистить";
	КонецЕсли;
	
КонецПроцедуры // ОбновитьНадписи()

&НаСервере
// Проверяет вид номенклатуры на допустимость для добавления в меню.
//  Номенклатура - проверяемый элемент номенклатуры.
//
// Возвращаемое значение:
//  ТекстОшибки - текст ошибки, если вид номенклатуры не допустимый.
//  Булево      – Истина, если эту номенклатуру можно добавлять в меню.
//
Функция ПроверитьДопустимыйВидНоменклатуры(Номенклатура, ТекстОшибки="")
	
	ТекстОшибки="";
	
	Если Номенклатура.ЭтоГруппа ИЛИ Номенклатура.Пустая() Тогда
		Возврат Истина;
	Иначе
		ВидНоменклатуры = Номенклатура.питВидНоменклатуры;
		Если ВидНоменклатуры = Перечисления.питВидыНоменклатуры.Блюдо
			ИЛИ ВидНоменклатуры = Перечисления.питВидыНоменклатуры.Товар
			ИЛИ ВидНоменклатуры = Перечисления.питВидыНоменклатуры.БизнесЛанч
			ИЛИ ВидНоменклатуры = Перечисления.питВидыНоменклатуры.Услуга Тогда
			Возврат Истина;
		Иначе
			ТекстОшибки = "Меню может содержать только номенклатуру вида: блюдо, услуга, товар, бизнес-ланч.";
			Объект.Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции // ПроверитьДопустимыйВидНоменклатуры()

&НаСервере
// Возвращает максимальный номер в группе.
//
// Возвращаемое значение:
//	Число - максимальный номер в группе справочника "питМеню".
//
Функция ПолучитьМаксимальныйНомерВГруппе()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(Меню.НомерВГруппе), 0) КАК НомерВГруппе
	|ИЗ
	|	Справочник.питМеню КАК Меню
	|ГДЕ
	|	Меню.Родитель = &Родитель
	|	И Меню.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Родитель", Объект.Родитель);
	Запрос.УстановитьПараметр("Владелец", Объект.Владелец);
	
	Результат	= Запрос.Выполнить();
	Выборка		= Результат.Выбрать();
	МаксНомер	= 0;
	Если Выборка.Следующий() Тогда
		МаксНомер	= Выборка.НомерВГруппе;
	КонецЕсли;
	Возврат МаксНомер;	
	
КонецФункции

&НаСервере
// Генерирует 10-значный код Simphony
// Первая цифра берется из MRS_КодMajorGroup группы аналитического учета номенклатуры
// Оставшиеся 9 цифр - уникальный порядковый номер
//
// Возвращаемое значение:
//   Число - сгенерированный 10-значный код Simphony
//
Функция СгенерироватьКодSimphony()
	
	КодSimphony = 0;
	
	// Проверяем наличие номенклатуры
	Если НЕ ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		Возврат КодSimphony;
	КонецЕсли;
	
	// Получаем данные о группе аналитического учета номенклатуры
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.ГруппаАналитическогоУчета.Родитель.MRS_КодMajorGroup КАК КодMajorGroup
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Объект.Номенклатура);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если НЕ Выборка.Следующий() Тогда
		Возврат КодSimphony;
	КонецЕсли;
	
	// Проверяем, заполнен ли код MajorGroup
	Если НЕ ЗначениеЗаполнено(Выборка.КодMajorGroup) Тогда
		Возврат КодSimphony;
	КонецЕсли;
	
	// Получаем первую цифру из кода MajorGroup
	СтрокаКодMajorGroup = Формат(Выборка.КодMajorGroup, "ЧГ=0");
	ПерваяЦифра = Число(Лев(9, 1));
	ПерваяЦифра = Число(Лев(СтрокаКодMajorGroup, 2));
	
	// Находим максимальный существующий код Simphony, начинающийся с этой цифры
	ЗапросМаксКод = Новый Запрос;
	ЗапросМаксКод.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(МАКСИМУМ(питМеню.MRS_КодSimphony), 0) КАК МаксКод
		|ИЗ
		|	Справочник.питМеню КАК питМеню
		|ГДЕ
		|	питМеню.MRS_КодSimphony >= &МинГраница
		|	И питМеню.MRS_КодSimphony < &МаксГраница";
	
	// Определяем границы диапазона для кодов, начинающихся с этой цифры
	МинГраница = ПерваяЦифра * 900000000; // Умножаем на 10^9
	МаксГраница = (ПерваяЦифра + 1) * 900000000;
	
	ЗапросМаксКод.УстановитьПараметр("МинГраница", МинГраница);
	ЗапросМаксКод.УстановитьПараметр("МаксГраница", МаксГраница);
	
	РезультатМаксКод = ЗапросМаксКод.Выполнить();
	ВыборкаМаксКод = РезультатМаксКод.Выбрать();
	
	Если ВыборкаМаксКод.Следующий() Тогда
		
		Если ВыборкаМаксКод.МаксКод = 0 Тогда
			// Это первый код с такой начальной цифрой
			КодSimphony = МинГраница + 1;
		Иначе
			// Увеличиваем максимальный код на 1
			КодSimphony = ВыборкаМаксКод.МаксКод + 1;
		КонецЕсли;
		
	Иначе
		// Ошибка выполнения запроса
		КодSimphony = МинГраница + 1;
	КонецЕсли;
	
	Возврат КодSimphony;
	
КонецФункции

&НаСервере
Процедура УстановитьЗначениеРеквизитовПриСменеНоменклатуры()
	Объект.Наименование = Объект.Номенклатура.Наименование;
	
	Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		Если НЕ ЗначениеЗаполнено(СпособРасчетаРецептур) Тогда
			//СпособРасчетаРецептур	= Константы.питСпособРасчетаРецептур.Получить();
			СпособРасчетаРецептур	= питОбщегоНазначенияСервер.ПолучитьЗначениеПоУмолчанию("СпособРасчетаРецептур");
		КонецЕсли;	
		
		Если Объект.Номенклатура.питВидНоменклатуры = Перечисления.питВидыНоменклатуры.Блюдо Тогда
			Объект.Рецептура	= питПроизводство.ВернутьОсновнуюРецептуру(Объект.Номенклатура,,Перечисления.питХозяйственныеОперации.РецептураПриготовление,ТекущаяДата(),СпособРасчетаРецептур);
		Иначе
			Объект.Рецептура = Документы.питРецептура.ПустаяСсылка();
		КонецЕсли;
		
		//Объект.ЕдиницаИзмерения = Объект.Номенклатура.ЕдиницаИзмерения;
		Справочники.УпаковкиЕдиницыИзмерения.ОтобразитьИнформациюОЕдиницеХранения(Объект.Номенклатура, Элементы.ЕдиницаИзмерения);
	КонецЕсли;
	
	// Генерация/перегенерация кода Simphony при изменении номенклатуры
	НоменклатураИзменилась = НЕ ЗначениеЗаполнено(ПредыдущаяНоменклатура) 
		ИЛИ Объект.Номенклатура <> ПредыдущаяНоменклатура;
	
	Если ЗначениеЗаполнено(Объект.Номенклатура) И НоменклатураИзменилась Тогда
		Объект.MRS_КодSimphony = СгенерироватьКодSimphony();
		ПредыдущаяНоменклатура = Объект.Номенклатура;
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	// Проверим, можно ли использовать номенклатуру.	
	ТекстОшибки = "";
	Если НЕ ПроверитьДопустимыйВидНоменклатуры(Объект.Номенклатура, ТекстОшибки) Тогда
		ПоказатьПредупреждение(,ТекстОшибки);
		Возврат;
	КонецЕсли; 
	
	УстановитьЗначениеРеквизитовПриСменеНоменклатуры();
КонецПроцедуры

&НаКлиенте
Процедура тОчиститьНажатие(Элемент)
	Объект.ИмяКартинки = "";
	КартинкаКлавиши = "";
	ОбновитьНадписи();
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура тКартинкаНажатие(Элемент)
	НачатьПоискФайлов(Новый ОписаниеОповещения("тКартинкаНажатие_Завершение", ЭтотОбъект, Новый Структура("Элемент", Элемент)), КаталогКартинок);
КонецПроцедуры

&НаКлиенте
Процедура тКартинкаНажатие_Завершение(НайденныеФайлы, ДополнительныеПараметры) Экспорт
	
	Элемент = ДополнительныеПараметры.Элемент;
	
	
	Если НайденныеФайлы.Количество() = 0 Тогда
		НачатьСозданиеКаталога(Новый ОписаниеОповещения("тКартинкаНажатие_Завершение_Завершение", ЭтотОбъект, Новый Структура("Элемент", Элемент)), КаталогКартинок);
		Возврат;
	КонецЕсли;
	
	тКартинкаНажатие_ЗавершениеФрагмент(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура тКартинкаНажатие_Завершение_Завершение(ИмяКаталога, ДополнительныеПараметры1) Экспорт
	
	Элемент = ДополнительныеПараметры1.Элемент;
	
	
	тКартинкаНажатие_ЗавершениеФрагмент(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура тКартинкаНажатие_ЗавершениеФрагмент(Знач Элемент)
	
	Перем Адрес, ДиалогВыбораФайла, Картинка, ПолноеИмяФайла, СтандартнаяОбработка;
	
	СтандартнаяОбработка=Ложь;
	ДиалогВыбораФайла=Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.Заголовок="Выберите файл с картинкой";
	ДиалогВыбораФайла.ПредварительныйПросмотр=Ложь;
	ДиалогВыбораФайла.ИндексФильтра=0;
	ДиалогВыбораФайла.Каталог = КаталогКартинок;
	//
	Если Элемент.Заголовок = "Выбор картинки" Тогда
		ДиалогВыбораФайла.ПолноеИмяФайла = "";
	Иначе
		ДиалогВыбораФайла.ПолноеИмяФайла = КаталогКартинок + Элемент.Заголовок;
	КонецЕсли; 
	//
	ДиалогВыбораФайла.Фильтр="Файлы BMP (*.bmp)|*.bmp|Файлы JPEG (*.jpg)|*.jpg";
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла=Истина;
	ДиалогВыбораФайла.ПредварительныйПросмотр = Истина;
	ДиалогВыбораФайла.Показать(Новый ОписаниеОповещения("тКартинкаНажатие_ЗавершениеФрагмент_Завершение", ЭтотОбъект, Новый Структура("ДиалогВыбораФайла, ПолноеИмяФайла", ДиалогВыбораФайла, ПолноеИмяФайла)));
	
КонецПроцедуры

&НаКлиенте
Процедура тКартинкаНажатие_ЗавершениеФрагмент_Завершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ДиалогВыбораФайла = ДополнительныеПараметры.ДиалогВыбораФайла;
	ПолноеИмяФайла = ДополнительныеПараметры.ПолноеИмяФайла;
	
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		
		// Необходимо проверить откуда выбран файл. Из каталога Images или из какого-либо другого.
		Если Найти(ДиалогВыбораФайла.ПолноеИмяФайла,КаталогКартинок) = 0 Тогда
			// Выбор НЕ из каталога Images.
			// Следует скопировать картинку в папку Images
			Объект.ИмяКартинки = СтрЗаменить(ДиалогВыбораФайла.ПолноеИмяФайла, ДиалогВыбораФайла.Каталог, "");
			ПолноеИмяФайла = КаталогКартинок + Объект.ИмяКартинки;
			НачатьКопированиеФайла(Новый ОписаниеОповещения("тКартинкаНажатие_ЗавершениеФрагмент_Завершение_Завершение", ЭтотОбъект, Новый Структура("ДиалогВыбораФайла, ПолноеИмяФайла", ДиалогВыбораФайла, ПолноеИмяФайла)), ДиалогВыбораФайла.ПолноеИмяФайла, ПолноеИмяФайла);
			Возврат;
			
		Иначе
			// Выбор НЕ из каталога Images.
			// Ничего копировать не надо.
			Объект.ИмяКартинки = СтрЗаменить(ДиалогВыбораФайла.ПолноеИмяФайла,КаталогКартинок,"");
			ПолноеИмяФайла = ДиалогВыбораФайла.ПолноеИмяФайла;
			
		КонецЕсли;
		тКартинкаНажатие_ЗавершениеФрагмент_ЗавершениеФрагмент(ПолноеИмяФайла);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура тКартинкаНажатие_ЗавершениеФрагмент_Завершение_Завершение(СкопированныйФайл, ДополнительныеПараметры1) Экспорт
	
	ДиалогВыбораФайла = ДополнительныеПараметры1.ДиалогВыбораФайла;
	ПолноеИмяФайла = ДополнительныеПараметры1.ПолноеИмяФайла;
	
	
	тКартинкаНажатие_ЗавершениеФрагмент_ЗавершениеФрагмент(ПолноеИмяФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура тКартинкаНажатие_ЗавершениеФрагмент_ЗавершениеФрагмент(Знач ПолноеИмяФайла)
	
	Перем Адрес, Картинка;
	
	Картинка = Новый Картинка(ПолноеИмяФайла);
	Адрес = ПоместитьВоВременноеХранилище(Картинка,Адрес); 
	КартинкаКлавиши = Адрес;
	ОбновитьНадписи();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаКлавишиНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	тКартинкаНажатие(Элемент);
КонецПроцедуры

&НаСервере
Функция ТоварУникаленВПрайсе()
	Если Объект.Владелец.ФлагУникальности И НЕ Справочники.питМеню.ТоварУникаленВПрайсе(Объект) Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции




////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ФОРМЫ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	питИзменениеОтраслевыхФормСервер.ПриСозданииНаСервереВНачале(ЭтаФорма, Отказ, СтандартнаяОбработка);
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	Справочники.УпаковкиЕдиницыИзмерения.ОтобразитьИнформациюОЕдиницеХранения(Объект.Номенклатура, Элементы.ЕдиницаИзмерения);
	
	Если Параметры.ЗначенияЗаполнения.Свойство("Владелец") Тогда
		Элементы.Владелец.Видимость = Ложь;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект", Объект);
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	
	// Сохраняем текущее значение номенклатуры для отслеживания изменений
	ПредыдущаяНоменклатура = Объект.Номенклатура;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	Если ЗначениеЗаполнено(Объект.Ссылка)  Тогда
		Попытка
			Картинка = Новый Картинка(КаталогКартинок + Объект.ИмяКартинки);
			Адрес = ПоместитьВоВременноеХранилище(Картинка,Адрес); 
			КартинкаКлавиши = Адрес;
			
		Исключение КонецПопытки;
	Иначе
		Если ЗначениеЗаполнено(Объект.ИмяКартинки) Тогда
			Попытка
				Картинка = Новый Картинка(КаталогКартинок + Объект.ИмяКартинки);
				Адрес = ПоместитьВоВременноеХранилище(Картинка,Адрес);
				КартинкаКлавиши = Адрес;
			Исключение КонецПопытки;
		КонецЕсли;
		МаксНомер = ПолучитьМаксимальныйНомерВГруппе();
		Объект.НомерВГруппе = МаксНомер + 1;
		
		// Генерация кода Simphony для нового элемента
		Если ЗначениеЗаполнено(Объект.Номенклатура) И НЕ ЗначениеЗаполнено(Объект.MRS_КодSimphony) Тогда
			Объект.MRS_КодSimphony = СгенерироватьКодSimphony();
		КонецЕсли;
		
	КонецЕсли;
	ОбновитьНадписи();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если НЕ ЗначениеЗаполнено(Объект.Наименование) Тогда
		Объект.Наименование = Объект.Номенклатура.Наименование;
	КонецЕсли;
	
	// Генерация кода Simphony для нового элемента, если он еще не сгенерирован
	Если ЗначениеЗаполнено(Объект.Номенклатура) И НЕ ЗначениеЗаполнено(Объект.MRS_КодSimphony) Тогда
		Объект.MRS_КодSimphony = СгенерироватьКодSimphony();
	КонецЕсли;
	
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
		Если Не ТоварУникаленВПрайсе() Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Товар не уникален в меню <" + Объект.Владелец + ">";
			Сообщение.Сообщить();
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

#Область УправлениеСвойствами

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
КонецПроцедуры

&НаКлиенте
// Обработчик нажатия на гиперссылку "История синхронизации"
//
Процедура MRS_ИсторияСинхронизацииНажатие(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПоказатьПредупреждение(, "Сначала необходимо сохранить элемент!");
		Возврат;
		
	КонецЕсли;
	
	// Открываем регистр сведений с отбором по текущей позиции меню
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура("ПозицияМеню", Объект.Ссылка));
	
	ОткрытьФорму(
		"РегистрСведений.MRS_ИсторияСинхронизацииМенюSimphony.ФормаСписка",
		ПараметрыФормы,
		ЭтотОбъект,
		УникальныйИдентификатор
	);
	
КонецПроцедуры

#КонецОбласти


КаталогКартинок = питОбщегоНазначения.ПолучитьКаталогКомпонентыЗащиты() + "Images\";
